from aiogram import Router, F
from aiogram.types import Message, CallbackQuery, ReplyKeyboardRemove
from aiogram.filters import Command

from src.db.database import sessionmaker
from src.filters.access_check import Guard
from src.keys.onboard_keys import cmd_start, method_work, work_form, story_complete_key, get_meet, \
    send_reglaments_about_services
from src.service.webhook_bitrix import get_ceo_by_username_in_bitrix

router = Router()


# Guard(session=sessionmaker),
@router.message(Command('start', prefix='!/') )
async def start(message: Message):
    await message.answer("""Привет и добро пожаловать в BANANAS TEAM! 

Я банановый бот – буду твоим помощником в первые дни.
Если в процессе будет что-то непонятно – всегда на связи Лера @to_see_sea, можешь написать ей по любым организационным вопросам. 

Давай начнём готовиться к нашему сотрудничеству – нажимай “поехали” и получай первое задание! 

ВАЖНО: не забудь нажимать кнопки после прочтения, чтобы тебе все нужные инструкции пришли.  """,reply_markup=cmd_start())
    # await message.bot.send_message()





@router.message(F.text == "☑️Поехали")
async def get_work_forms( message: Message ):
    empty_message = await message.answer(
        "ᅠ",  # невидимый символ
        reply_markup=ReplyKeyboardRemove()
    )
    await empty_message.delete()
    await message.answer("""Для начала выбери формат сотрудничества с компанией
""", reply_markup=method_work())

# @router.message()
# async def work_form( message: Message ):
#     print(message.text.lower())

#
#
#
# @router.message(F.text.lower() == "")
# async def get_form_work( message: Message ):
#     if message.text == "":
#         text = ''
#     else:
#         text = ''
#
#
#     await message.answer(text,)


@router.callback_query((F.data == "employment contract") |( F.data == "agreement with an entrepreneur"))
async def get_work_forms(callback: CallbackQuery):
    if callback.data == "employment contract":
        await callback.message.answer(


            """Заполни <a href="https://b24-aohl7e.bitrix24.site/crm_form_i0smq/">форму</a> для бухгалтерии и запуска подготовки документов для сотрудничества 
            
Можешь не торопиться, заполнить в любое удобное время до завтра. Если при заполнении появятся вопросы – напиши Лере @to_see_sea

После заполнения на указанную почту придёт уведомление о том, что можно подписать NDA. После подписания  NDA договор готовится в течение 2-3 дней, уведомление также придёт на указанную почту.""",

            reply_markup=work_form(), parse_mode="HTML"
        )
    else:
        await callback.message.answer(

            """Заполни <a href="https://b24-aohl7e.bitrix24.site/crm_form_ubin0/">форму</a> для бухгалтерии и запуска подготовки документов для сотрудничества 
            
Можешь не торопиться, заполнить в любое удобное время до завтра. Если при заполнении появятся вопросы – напиши Лере @to_see_sea

После заполнения на указанную почту придёт уведомление о том, что можно подписать NDA. После подписания  NDA договор готовится в течение 2-3 дней, уведомление также придёт на указанную почту.""",
            reply_markup=work_form(), parse_mode="HTML"
        )


@router.callback_query(F.data == "form complete")
async def form_complete(callback: CallbackQuery):
    await callback.message.answer("""<b>Поздравляю, ты почти у цели!</b>

В начале сотрудничества мы представим тебя BANANAS  TEAM, для этого подготовь пару слов о себе и выбери своё самое сногшибательное фото. Результат добавь в форму по <a href="https://forms.gle/ePpmzzY59jgfQQzX7">ссылке</a>

<b>Подсказка.</b> Чтобы было легче написать о себе вот несколько тем, о которых ты можешь рассказать: 
В каких интересных проектах и компаниях ты работал? 
Какая твоя суперсила сделает компанию лучше? 
Поделись профессиональными навыками.
Какие у тебя хобби и увлечения?
Вспомни какой-то интересный факт о себе.

<b>Важно:</b> постарайся рассказать о самом интересном кратко, так как в сообщениях есть лимит и мы не сможем написать много (до 1500 символов). В будущем у тебя будет возможность рассказать о себе ещё подробнее, поэтому всё, что не влезет – сохраняй!
""",
                         reply_markup=story_complete_key(), parse_mode="HTML"
                         )

@router.callback_query(F.data == "story complete")
async def story_complete(callback: CallbackQuery):
    await callback.message.answer("""Молодец! Мы обрабатываем информацию, которую ты нам передал и с нетерпением, когда ты приступишь к задачам!

Пока предлагаем посмотреть презентацию о наших ценностях по <a href="https://drive.google.com/file/d/1Qojv_nSK1SV8-WyhuXROXKQMnW6H1LrE/view?usp=sharing">ссылке</a>

И остаёмся на связи – за день до дня Х я пришлю всю вводную информацию. Если возникнут вопросы – пиши Лере @to_see_sea""", parse_mode="HTML")



@router.callback_query(F.data == "send check list")
async def check_list(callback: CallbackQuery):
    await callback.message.answer("""Важно, чтобы эти пункты были выполнены. Если с каким-то из них возникли проблемы – обратись, пожалуйста, к Лере @to_see_sea

✔ Заполнена анкета по ссылке для оформления документов
✔ Подписан NDA
✔ Подготовлен рассказ о себе и загружен в форму

Если всё сделал, то дальше предлагаю отдыхать. Мы очень ждём твоего выхода, до завтра!""")


@router.callback_query(F.data == "what next")
async def access_complete(callback: CallbackQuery):
    # await callback.bot.send_message(1864950681, 'Можно выключать')
    ceo = get_ceo_by_username_in_bitrix(callback.from_user.username)
    await callback.message.answer(f"""Сегодня пройдёт твоя встреча с руководителем, где вы подробнее обсудите проект и задачи. 

Напоминаю, что твой руководитель {ceo}. Ты всегда можешь написать ему личное сообщение в Битрикс. Также твой руководитель готовит план по адаптации, чтобы проще было разобраться с задачами, который скинет тебе после встречи. """,
                                  reply_markup=get_meet())


@router.callback_query(F.data == "send access complete")
async def send_info_about_services(callback: CallbackQuery):
    await callback.message.answer(
        """
    Вот несколько инструкций по работе с корпоративными программами, которые помогут тебе в работе:
    
    📄Lastpass
    https://rbbase.ru/marketplace/app/32/?page=359873
    
    📄 Установке мобильной версии Битрикса
    https://rbbase.ru/marketplace/app/32/?page=359878Э
    
    📄 Инструкция общим дискам
    https://rbbase.ru/marketplace/app/32/?page=359877
    
    🙏Сообщения останутся в этом чате, поэтому можешь вернуться к инструкциям при необходимости.  
    """, reply_markup=send_reglaments_about_services())

@router.callback_query(F.data == "go meet")
async def access_cancel(callback: CallbackQuery):
    await callback.message.answer("""
Отлично! Если будут вопросы – не стесняйся и пиши Лере или руководителю – они с радостью тебе помогут!

А я пока прощаюсь с тобой, до новых встреч🙃""")